"number" + 3 + 3;
// змінні виразу приводяться до string і виконується операція конкатинації.
// Число 3 має тип Number, який перетворюється на рядок, тож 3 отримує значення '3'.
// 'number' + '3' + '3' -> result = number33

null + 3;
// значення null еквівалентно числу 0 типу Number. result = 3.

5 && "qwerty"
    // 5 і  "qwerty" != 0, "" (порожній рядок), null, undefined, NaN (Not a Number), відповідно переходять у true
    // логічне І повертає останній true -> result =  qwerty

+"40" + +"2" + "hillel";
// +'40' - унарний + перетворює рядок '40' на число 40
// другий - арифметичне додавання, третій + - це знак конкатинації
// +'2' - перетворює рядок '2' на число 2
// після перетворень маємо вираз 40 + 2 + "hillel";
//40 + 2 = 42
//42 + "hillel" - число 42 перетворюється у рядок і виконується операція конкатинації
// result = "42hillel"

"10" - 5 === 6;
// '10' приводиться до типу Number.
// Після перетворення вираз має вигляд: 10 - 5 === 6;
// 5 === 6 - строге порівняння перевіряє чи дорівнює значення праворуч значенню ліворуч
// та чи до однакового типу даних належать змінні.
// хоча тип даних 5 і 6 - це Number, але значення 5 не дорівнює значенню 6. result = false

true + false;
// вираз виконує операцію арифметичного додавання.
// булеві значення true і false відповідають значенням 1 і 0 типу Number
// після перетворення вираз має вигляд: 1 + 0 -> result = 1

"4px" - 3;
// вираз виконує операцію арифметичного віднімання.
// рядкове значення '4px' має бути переведено в Number, але це неможливо, тож
// '4px' отримує значенням NaN
// після перетворення вираз має вигляд: NaN - 3 -> result = NaN

"4" - 3;
// вираз виконує операцію арифметичного віднімання.
// рядкове значення '4' перетворюється в Number: '4' = 4
// після перетворення вираз має вигляд: 4 - 3 -> result = 1

"6" + 3 ** 0;
//за пріоритетом першою має виконуватися операція возведення в ступінь - 3 **0 = 1
//після спрощення вираз має вигляд: '6' + 1 - виконується операція конкатинації
// значення 1 приводиться до типу String - '1'
// '6' + '1' -> result = '61'

12 / "6";
// вираз виконує операцію арифметичного ділення.
// рядкове значення '6' перетворюється в Number: '6' = 6
// після перетворення вираз має вигляд: 12 / 6 -> result = 2

"10" + (5 === 6);
//за пріоритетом першою має виконуватися операція в дужках: 5 === 6
// 5 === 6 - строге порівняння. Хоча тип даних 5 і 6 - це Number, але значення 5 не дорівнює значенню 6,
// тож result = false
//після спрощення вираз має вигляд: '10' + false - виконується операція конкатинації
// булеве значення false приводиться до типу String - 'false'
// '10' + 'false' -> result = '10false'

null == '';
// null дорівнює лише undefuned
// рядок ' ' визначений, тож не дорівнює undefuned
// result = false

3 ** (9 / 3);
//за пріоритетом першою має виконуватися операція в дужках: 9 / 3 = 3
//після спрощення вираз має вигляд: 3 ** 3 - виконується операція возведення в ступінь -> result = 27

!!"false" == !!"true";
// ! - інвертує вираз, відповідно, !! - це подвійна інверсія.
// !!'false' містить непорожній рядок, відповідно, 'false' переводиться в булеве true
// перша інверсія інвертує true в false, друга інверсія інвертує false в true: !'false' = false
// друга інверсія перетворює false в true, тож !!'false' = true
// за аналогією отримуємо !!'true' = true
// true == true -> result = true

0 || '0' && 1
// && має вищий пріоритет, тож обчислюється першим. непорожній рядок '0' отримує значення true
// true && 1 = true && true - повертається останнє true, тобто 1
// 0 || 1 = false || true. || повертає перше значення, якщо воно true, і друге значення, якщо перше дорівнює false
// у даному виразі перше значення дорівнює false, тож повертається друге - 1. result = 1

(+null == false) < 1;
// за пріоритетом виконується операція в дужках - +null == false. унарний + перетворює null на число 0
// == - нестроге порівняння, тож булеве значення false перетворюється на число 0
// після перетворення маємо вираз 0 == 0, що отримує true
// після спрощення маємо вираз true < 1
// оператор < порівнює числа, тож булеве значення true перетворюється на число 1
// маємо вираз 1 < 1 -> result = false

(false && true) || true;
// && має вищий пріоритет, тож обчислюється першим. перше значення виразу є false, тож && повертає його
// маємо вираз false || true. У даному виразі перше значення дорівнює false, тож повертається друге - true. result = true

false && (false || true);
// || обчислюється першим, бо записано в дужках. перше значення виразу є false, тож || повертає друге значення - true
// маємо вираз false && true. У даному виразі перше значення дорівнює false, тож повертається саме воно - false.
// result = false

(+null == false) < 1 ** 5;
// за пріоритетом виконується операція в дужках - +null == false. унітарний + перетворює null на число 0
// == - нестроге порівняння, тож булеве значення false перетворюється на число 0
// після перетворення маємо вираз 0 == 0, що отримує true
// наступна операція за пріоритетом - возведення в ступінь  1 ** 5 = 1
// після спрощення маємо вираз true < 1
// оператор < порівнює числа, тож булеве значення true перетворюється на число 1
// маємо вираз 1 < 1 -> result = false
